{
  "tld_to_id": {
    "<PAD>": 0,
    "<UNK>": 1,
    "ab.ca": 2,
    "ac": 3,
    "ac.at": 4,
    "ac.be": 5,
    "ac.id": 6,
    "ac.il": 7,
    "ac.in": 8,
    "ac.ir": 9,
    "ac.jp": 10,
    "ac.kr": 11,
    "ac.nz": 12,
    "ac.th": 13,
    "ac.uk": 14,
    "ac.za": 15,
    "academy": 16,
    "ad": 17,
    "ad.jp": 18,
    "adv.br": 19,
    "ae": 20,
    "aero": 21,
    "africa": 22,
    "ag": 23,
    "agency": 24,
    "ai": 25,
    "al": 26,
    "am": 27,
    "amsterdam": 28,
    "app": 29,
    "ar": 30,
    "art": 31,
    "art.br": 32,
    "as": 33,
    "asia": 34,
    "at": 35,
    "aw": 36,
    "az": 37,
    "ba": 38,
    "band": 39,
    "bar": 40,
    "bayern": 41,
    "bc.ca": 42,
    "be": 43,
    "berlin": 44,
    "best": 45,
    "bet": 46,
    "bg": 47,
    "bid": 48,
    "bike": 49,
    "bio": 50,
    "biz": 51,
    "blog": 52,
    "blue": 53,
    "br": 54,
    "build": 55,
    "business": 56,
    "buzz": 57,
    "by": 58,
    "bz": 59,
    "ca": 60,
    "cafe": 61,
    "cam": 62,
    "capital": 63,
    "care": 64,
    "casa": 65,
    "cash": 66,
    "cat": 67,
    "cc": 68,
    "center": 69,
    "ceo": 70,
    "cf": 71,
    "ch": 72,
    "chat": 73,
    "church": 74,
    "ci": 75,
    "city": 76,
    "cl": 77,
    "click": 78,
    "cloud": 79,
    "club": 80,
    "cm": 81,
    "cn": 82,
    "co": 83,
    "co.ao": 84,
    "co.at": 85,
    "co.cr": 86,
    "co.id": 87,
    "co.il": 88,
    "co.in": 89,
    "co.jp": 90,
    "co.ke": 91,
    "co.kr": 92,
    "co.ls": 93,
    "co.mz": 94,
    "co.nz": 95,
    "co.rs": 96,
    "co.th": 97,
    "co.tz": 98,
    "co.ug": 99,
    "co.uk": 100,
    "co.za": 101,
    "co.zw": 102,
    "coach": 103,
    "codes": 104,
    "coffee": 105,
    "com": 106,
    "com.ar": 107,
    "com.au": 108,
    "com.bd": 109,
    "com.bo": 110,
    "com.br": 111,
    "com.cn": 112,
    "com.co": 113,
    "com.cy": 114,
    "com.do": 115,
    "com.ec": 116,
    "com.eg": 117,
    "com.es": 118,
    "com.fj": 119,
    "com.gr": 120,
    "com.gt": 121,
    "com.hk": 122,
    "com.hr": 123,
    "com.mk": 124,
    "com.mt": 125,
    "com.mx": 126,
    "com.my": 127,
    "com.ng": 128,
    "com.ni": 129,
    "com.np": 130,
    "com.pe": 131,
    "com.ph": 132,
    "com.pk": 133,
    "com.pl": 134,
    "com.pt": 135,
    "com.py": 136,
    "com.sa": 137,
    "com.sg": 138,
    "com.sv": 139,
    "com.tr": 140,
    "com.tw": 141,
    "com.ua": 142,
    "com.uy": 143,
    "com.ve": 144,
    "com.vn": 145,
    "community": 146,
    "company": 147,
    "consulting": 148,
    "cool": 149,
    "coop": 150,
    "cr": 151,
    "cw": 152,
    "cx": 153,
    "cyou": 154,
    "cz": 155,
    "de": 156,
    "desa.id": 157,
    "design": 158,
    "dev": 159,
    "dev.br": 160,
    "directory": 161,
    "dk": 162,
    "do": 163,
    "dog": 164,
    "domains": 165,
    "dp.ua": 166,
    "dz": 167,
    "earth": 168,
    "ec": 169,
    "edu": 170,
    "edu.ar": 171,
    "edu.au": 172,
    "edu.br": 173,
    "edu.cn": 174,
    "edu.co": 175,
    "edu.hk": 176,
    "edu.in": 177,
    "edu.mx": 178,
    "edu.my": 179,
    "edu.np": 180,
    "edu.pe": 181,
    "edu.ph": 182,
    "edu.pl": 183,
    "edu.tr": 184,
    "edu.tw": 185,
    "edu.vn": 186,
    "education": 187,
    "ee": 188,
    "email": 189,
    "energy": 190,
    "eng.br": 191,
    "es": 192,
    "eu": 193,
    "eus": 194,
    "events": 195,
    "exchange": 196,
    "expert": 197,
    "family": 198,
    "farm": 199,
    "fi": 200,
    "finance": 201,
    "fit": 202,
    "fitness": 203,
    "fm": 204,
    "foundation": 205,
    "fr": 206,
    "fun": 207,
    "fund": 208,
    "fyi": 209,
    "ga": 210,
    "gallery": 211,
    "games": 212,
    "gd": 213,
    "ge": 214,
    "gen.tr": 215,
    "gg": 216,
    "gl": 217,
    "global": 218,
    "gmbh": 219,
    "go.id": 220,
    "go.jp": 221,
    "go.th": 222,
    "gob.mx": 223,
    "gold": 224,
    "gov": 225,
    "gov.au": 226,
    "gov.bd": 227,
    "gov.br": 228,
    "gov.cn": 229,
    "gov.in": 230,
    "gov.pl": 231,
    "gov.uk": 232,
    "gp": 233,
    "gq": 234,
    "gr": 235,
    "group": 236,
    "gs": 237,
    "guide": 238,
    "guru": 239,
    "hamburg": 240,
    "health": 241,
    "help": 242,
    "hk": 243,
    "host": 244,
    "hosting": 245,
    "house": 246,
    "hr": 247,
    "hu": 248,
    "icu": 249,
    "id": 250,
    "id.au": 251,
    "idv.tw": 252,
    "ie": 253,
    "im": 254,
    "immo": 255,
    "in": 256,
    "in-addr.arpa": 257,
    "in.th": 258,
    "in.ua": 259,
    "ind.br": 260,
    "inf.br": 261,
    "info": 262,
    "info.pl": 263,
    "ink": 264,
    "international": 265,
    "io": 266,
    "ir": 267,
    "is": 268,
    "it": 269,
    "jobs": 270,
    "jp": 271,
    "kg": 272,
    "kiev.ua": 273,
    "koeln": 274,
    "kr": 275,
    "kred": 276,
    "kz": 277,
    "la": 278,
    "land": 279,
    "law": 280,
    "li": 281,
    "life": 282,
    "link": 283,
    "live": 284,
    "lk": 285,
    "llc": 286,
    "lol": 287,
    "london": 288,
    "love": 289,
    "lt": 290,
    "ltd": 291,
    "lu": 292,
    "lv": 293,
    "ly": 294,
    "ma": 295,
    "market": 296,
    "marketing": 297,
    "mc": 298,
    "md": 299,
    "me": 300,
    "me.uk": 301,
    "media": 302,
    "media.pl": 303,
    "men": 304,
    "mg": 305,
    "mil": 306,
    "mk": 307,
    "ml": 308,
    "mn": 309,
    "mobi": 310,
    "moe": 311,
    "money": 312,
    "monster": 313,
    "moscow": 314,
    "mp": 315,
    "ms": 316,
    "mu": 317,
    "mus.br": 318,
    "mx": 319,
    "my": 320,
    "my.id": 321,
    "na": 322,
    "name": 323,
    "nc": 324,
    "ne.jp": 325,
    "net": 326,
    "net.ae": 327,
    "net.ar": 328,
    "net.au": 329,
    "net.ba": 330,
    "net.br": 331,
    "net.cn": 332,
    "net.co": 333,
    "net.do": 334,
    "net.gt": 335,
    "net.id": 336,
    "net.il": 337,
    "net.in": 338,
    "net.ma": 339,
    "net.mx": 340,
    "net.my": 341,
    "net.ni": 342,
    "net.nz": 343,
    "net.pk": 344,
    "net.pl": 345,
    "net.sg": 346,
    "net.tr": 347,
    "net.tt": 348,
    "net.tw": 349,
    "net.ua": 350,
    "net.uk": 351,
    "net.uy": 352,
    "net.ve": 353,
    "network": 354,
    "news": 355,
    "nf": 356,
    "ng": 357,
    "ninja": 358,
    "nl": 359,
    "no": 360,
    "ns.ca": 361,
    "nu": 362,
    "nv.us": 363,
    "nyc": 364,
    "nz": 365,
    "od.ua": 366,
    "odessa.ua": 367,
    "on.ca": 368,
    "one": 369,
    "online": 370,
    "or.id": 371,
    "or.jp": 372,
    "or.kr": 373,
    "org": 374,
    "org.ar": 375,
    "org.au": 376,
    "org.br": 377,
    "org.cn": 378,
    "org.il": 379,
    "org.in": 380,
    "org.mx": 381,
    "org.ng": 382,
    "org.nz": 383,
    "org.pl": 384,
    "org.tr": 385,
    "org.tw": 386,
    "org.ua": 387,
    "org.uk": 388,
    "org.za": 389,
    "ovh": 390,
    "page": 391,
    "paris": 392,
    "party": 393,
    "pe": 394,
    "pf": 395,
    "ph": 396,
    "photo": 397,
    "photography": 398,
    "photos": 399,
    "pk": 400,
    "pl": 401,
    "plus": 402,
    "pm": 403,
    "press": 404,
    "pro": 405,
    "ps": 406,
    "psi.br": 407,
    "pt": 408,
    "pub": 409,
    "pw": 410,
    "qa": 411,
    "qc.ca": 412,
    "re": 413,
    "realtor": 414,
    "realty": 415,
    "red": 416,
    "rest": 417,
    "review": 418,
    "ro": 419,
    "rocks": 420,
    "rs": 421,
    "run": 422,
    "sa": 423,
    "sch.id": 424,
    "school": 425,
    "science": 426,
    "scot": 427,
    "se": 428,
    "services": 429,
    "sg": 430,
    "sh": 431,
    "sh.cn": 432,
    "shop": 433,
    "show": 434,
    "si": 435,
    "site": 436,
    "sk": 437,
    "sk.ca": 438,
    "sn": 439,
    "so": 440,
    "social": 441,
    "software": 442,
    "solutions": 443,
    "space": 444,
    "srv.br": 445,
    "st": 446,
    "store": 447,
    "stream": 448,
    "studio": 449,
    "support": 450,
    "swiss": 451,
    "sx.cn": 452,
    "systems": 453,
    "tc": 454,
    "team": 455,
    "tec.br": 456,
    "tech": 457,
    "technology": 458,
    "tel": 459,
    "tips": 460,
    "tk": 461,
    "tl": 462,
    "tn": 463,
    "to": 464,
    "today": 465,
    "tokyo": 466,
    "tools": 467,
    "top": 468,
    "trade": 469,
    "training": 470,
    "travel": 471,
    "tv": 472,
    "tw": 473,
    "tx.us": 474,
    "ua": 475,
    "ug": 476,
    "uk": 477,
    "uno": 478,
    "us": 479,
    "uy": 480,
    "uz": 481,
    "vc": 482,
    "ventures": 483,
    "video": 484,
    "vip": 485,
    "vn": 486,
    "vn.ua": 487,
    "vu": 488,
    "wales": 489,
    "wang": 490,
    "watch": 491,
    "waw.pl": 492,
    "web.id": 493,
    "website": 494,
    "wf": 495,
    "wien": 496,
    "wiki": 497,
    "win": 498,
    "wine": 499,
    "work": 500,
    "works": 501,
    "world": 502,
    "ws": 503,
    "wtf": 504,
    "xn--fiqs8s": 505,
    "xn--p1acf": 506,
    "xn--ses554g": 507,
    "xxx": 508,
    "xyz": 509,
    "ye": 510,
    "zone": 511,
    "zp.ua": 512
  },
  "version": "1.0"
}